a = int(input("Введіть значення 'a':"))
b = int(input("Введіть значення 'b':"))
if a < 1 or a > 100:
    print("Помилка!\nЗначення 'а' не входить у заданий проміжок чисел.\nПерезапустіть програму і введіть значення а і b, які можуть приймати значення від 1 до 100" )
elif b < 1 or b > 100:
    print("Помилка!\nЗначення 'b' не входить у заданий проміжок чисел.\nПерезапустіть програму і введіть значення а і b, які можуть приймати значення від 1 до 100")
else:
    if a > b:
        x = a * a - b
        print("X = ", x)
    if a == b:
        x = -a
        print("X = ", x)
    if a < b:
        x = (a * b - 1)/b
        print("X = ", x)